# Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?
Birds=int(input("Сделали всего ребята журавликов: "))
Katya=int(Birds/6*4)
Serezha=int(Birds/6)
Petya=int(Birds/6)
print(f" Катя сделала {Katya} журавликов")
print(f'Серёжа сделал {Serezha} журавликов')
print(f'Петя сделал {Serezha} журавликов')
